function U=forwarddif(f,c1,c2,c,a,b,n,m)
%功能: 用向前差分法求解热传导方程u_t=c*u_{xx}
%输入: f=u(x,0), 初始条件函数,f为函数句柄;
%        c1=u(0,t),c2=u(1,t),边界条件
%        a,b分别为空间域[0,a]和时间域[0,b]右端点
%        n,m分别为[0,a]和[0,b]上的等分节点数
%输出: U为解矩阵,行为空间节点,列为时间节点
%初始化
h=a/(n-1); k=b/(m-1);
r=c*k/h^2;  s=1-2*r; 
U=zeros(n,m);
%边界条件
U(1,1:m)=c1; U(n,1:m)=c2;
%初始内部节点赋值-时间第一层
U(2:n-1,1)=feval(f,h:h:(n-2)*h)';
%显式迭代计算其他时间层
for j=2:m
    for i=2:n-1
        U(i,j)=s*U(i,j-1)+r*(U(i-1,j-1)+U(i+1,j-1));
    end
end
U=U';
