%高斯型积分公式MATLAB程序
function s=mgsint(f,a,b,n,m)
%用途: 用定步长高斯求积公式求函数的积分
%格式: s=mgsint(f,a,b,n,m), f是被积函数,
%a,b分别为积分下上限, n为等分数, m为每段高斯点数
switch m
  case 1
      t=0; A=1;
  case 2
      t=[-1/sqrt(3), 1/sqrt(3)]; A=[1,1];
  case 3
      t=[-sqrt(0.6), 0.0, sqrt(0.6)]; A=[5/9, 8/9, 5/9];
  case 4
      t=[-0.861136, -0.339981, 0.339981, 0.861136];
      A=[0.347855, 0.652145,  0.652145, 0.347855];
  case 5
      t=[-0.906180, -0.538469, 0.0, 0.538469, 0.906180];
      A=[0.236927, 0.478629, 0.568889, 0.478629, 0.236927];
  case 6
      t=[-0.932470, -0.661209, -0.238619, 0.238619, 0.661209, 0.932470];
      A=[0.171325, 0.360762, 0.467914,  0.467914, 0.360762, 0.171325];
  otherwise
     error('本程序高斯点数只能取1,2,3,4,5,6!');
end
x=linspace(a,b,n+1);  s=0;
for i=1:n
   s=s+gsint(f,x(i),x(i+1),A,t);
end
%子函数程序
function g=gsint(f,a,b,A,t)
g=(b-a)/2*sum(A.*feval(f,(b-a)/2*t+(a+b)/2));